# Master Core Vocabulary — All 7 Foundation Packs
# 1719 unique words (zero cross-pack overlap)
# Generated 2026-07-16
# Packs: ① beginner ② daily-life ③ daily-work ④ essential-phrases ⑤ opinion-basics ⑥ social-express ⑦ travel-basic
'll
a decade ago
a while ago
able
above
abruptly
absolutely
accent
accept
accident
accomplish
account
accountable
accumulate
achieve
achievement
acquaintance
acquire
acquires
across
active
adapt
adaptation
address
adjust
adjustment
adult
advance
advise
afford
afraid
afterward
age
ages ago
ago
agree
aid
alarm
all the time
allergy
ally
almost
along
alphabet
already
also
alternative
although
always
am
amateur
amazed
amazing
ambulance
america
amount
amused
ancient
angry
anniversary
annoyed
annoying
anomaly
answer
any
anyone
anyway
apart
apologize
app
appear
appetizer
apple
appointment
appreciate
approach
approximate
april
aquarium
are
around
arrange
arrangement
arrival
artist
asap
aside
ask
asleep
assist
assistant
associate
assume
assure
at
at first
at that time
ate
attain
attempt
attend
attended
auction
audio
august
autumn
avenue
average
avoid
awake
awful
back in the day
back in time
back then
backward
bag
balance
bald
banana
banquet
barbecue
barely
bargain
bath
battery
beautiful
become
been
before long
beforehand
begin
beginner
behave
behind
believe
belong
below
beside
better
between
beyond
bicycle
big
birthday
bitter
black
bland
blanket
bless
blessing
blink
block
blonde
blue
boiled
boiling
book
booked
boots
bored
boring
born
borrow
boss
bottom
boulevard
bowl
box
brand
brave
bread
breakfast
breezy
bridge
briefly
brighter
brilliant
bring
broken
brother
brown
browse
brunette
brush
brushed
build
busier
busy
butter
button
buy
by now
by then
bye
bypass
cab
calendar
call
callback
calm
came
camping
can
cancel
capture
car
care
careful
carefully
carnival
carries
carry
casual
celebrate
celebration
centuries ago
century
cereal
ceremony
certainly
chair
challenging
change
charge
charity
chat
cheap
check
checked
cheer
chef
child
childhood
chilly
china
chinese
choice
choose
chopsticks
christmas
chubby
cinema
circus
city
claim
clarify
classmate
clean
cleaned
clearly
climb
clinic
close
cloudy
club
coat
code
coffee
coin
cold
collar
colleague
collect
collector
colour
comb
combo
come
comfort
comfortable
comfortably
commit
committed
communicate
community
commute
companion
compare
compass
competitive
complete
completely
concentrate
concern
concert
conclude
conductor
conference
confidence
confident
confirm
confused
congratulate
connection
consider
consistently
constantly
contain
contains
contemporary
continue
continuously
contrast
contribute
conveniently
convention
cook
cooked
cool
cooperate
coordinate
cope
cost
cotton
could
count
countless
country
courage
coverage
create
credit
critical
cross
crosswalk
crowded
cup
cure
curly
currently
custom
cute
cycle
daily
damaged
damp
dance
dangerous
dark
darker
date
daughter
day
deadline
debit
decade
december
decide
decision
decline
decrease
dedicated
deduce
deeper
defective
definitely
delay
delicious
delighted
deliver
demanding
department
departure
dependable
deposit
describe
deserve
design
designer
despite
dessert
destination
detective
deteriorate
determined
detour
develop
deviation
diagonal
dial
diary
dictionary
did
didn't
differ
dinner
direction
directly
directory
dirty
disagree
disappear
disappointed
disciplined
discount
discover
dish
disoriented
display
distance
distract
dive
divert
doctor
doesn't
don't
donate
done
door
dosage
double
doublecheck
doubt
down
downtown
downward
doze
drank
draw
dream
dress
drink
drip
drive
driven
driver
drop
dropoff
drove
dry
during
dust
each time
eager
earlier
earlier on
earlier that day
early
earn
earthquake
eaten
eavesdrop
echo
effort
egg
eight
eighteen
eighth
eighty
elevator
eleven
embarrassed
emergency
empty
encourage
endless
endlessly
energetic
engineer
english
enjoy
enjoyment
enlisted
enrolled
enter
entertain
enthusiast
enthusiastic
entirely
entrance
era
escape
estimate
evacuate
event
eventually
ever
every
every time
everybody
everyone
everything
evidence
evolution
evolve
exact
examination
examine
exception
exchange
exchangeable
excited
exciting
exclusively
excuse
exercise
exhausted
exhibition
exit
expect
expensive
expert
explain
explore
expo
express
extension
extensively
facilitate
fade
fail
faithfully
fake
family
fan
fancy
fantastic
faraway
fare
farmer
fascinated
fashion
fast
faster
father
fault
favorite
feast
february
fee
feed
feel
felt
ferry
festival
fetch
fifteen
fifth
fifty
figure
file
finally
find
fine
finish
finished
firefighter
first
firstaid
fishing
fit
five
fix
flashback
flatmate
flew
flexible
float
flood
floral
fluent
flutter
focus
foggy
fold
follow
for
forget
forgive
fork
formal
formerly
forth
forty
forward
found
four
fourteen
fourth
freckled
free
freezing
frequency
frequently
fresh
friday
fried
friendly
from
from now on
from time to time
front
frown
fulfill
full
funny
furious
future
gain
gallery
gardening
gate
gather
gathering
gave
gaze
generally
generation
gentle
gentler
genuine
genuinely
gesture
give
glad
glance
glass
gloomy
glow
go
goal
gone
gonna
good
goodbye
gorgeous
got
gradually
graduation
grateful
great
green
grew up
grilled
grin
grow
guarantee
guess
guest
guide
gym
habit
had
hailed
half
hand
handle
handsome
hang
hang out
happen
happier
happy
harder
hardly
hardly ever
has
hate
he
headset
heal
healthier
hear
heavier
hello
helmet
help
helped
helpful
henceforth
here
herself
hesitant
hi
highly
highway
hike
himself
historic
hobby
hobbyist
hold
holds
holiday
home
homeward
honest
hope
hopeless
host
hot
hourly
house
how
howcome
however
humid
hundred
hungry
hurry
husband
i
idea
identify
if
imagine
immediate
immediately
improve
in
in earlier times
in former times
in modern times
in the beginning
in the near future
in the old days
in the past
in this era
in those days
include
includes
incorrect
increase
indoors
inevitably
infer
infinite
inform
infrequently
initially
injection
inside
insomnia
inspire
installment
instantly
instead
insurance
intend
intensively
interesting
interference
intermittently
interpret
interrupt
intersection
introduce
invariably
invite
inward
iron
irregular
is
it
its
itself
jam
january
japan
japanese
jog
join
joined
journalist
journey
judgment
juice
july
june
just
keen
keep
keeps
key
kilometer
kind
kindly
knew
knife
know
lack
landmark
lane
language
last
late
lately
later
lawyer
lazy
learn
learned
leather
leave
lecture
left
lend
lick
lifeguard
lift
light
lighter
lightning
like
liked
likely
link
list
listen
litter
live
lobby
local
locate
lock
lonelier
lonely
long
long ago
longer
longterm
look
loose
lose
loud
loudly
loudspeaker
love
luggage
lunch
mailbox
maincourse
mainly
make
manage
many
march
match
material
mattress
mature
may
maybe
me
meal
meaningful
meanwhile
measure
media
meditation
meet
meeting
memory
menu
merely
message
messy
meter
midnight
might
migrate
mild
mile
milestone
milk
millennial
mirror
miserable
mistake
misunderstanding
momentarily
monday
money
month
monthly
mop
more
morning
most
most days
mostly
mother
motivate
motivated
moved
much
multitask
muscular
museum
must
mute
my
myself
nah
name
nap
napkin
narrower
native
navigate
near
nearby
nearest
nearly
necessary
need
negative
neighbor
neither
nervous
network
never
new
next
nice
night
nightmare
nil
nine
nineteen
ninety
ninth
no
no one
nobody
noisy
none
noon
nope
nor
norm
nostalgia
not
note
nothing
notice
notify
november
now
now and then
nowadays
nowhere
nudge
number
numerous
nurse
o'clock
obey
observe
obtain
obtains
occasion
occasionally
occupy
occur
october
off
offer
offline
often
oily
ok
okay
old
on
once
once in a while
once upon a time
one
one day
online
only
open
operator
opinion
opposite
opt
option
or
orange
order
organize
organized
original
originally
otherwise
our
ourselves
outdoors
outgoing
outside
outward
over
overhear
overpass
oversleep
overwhelmingly
own
owns
packed
paint
pajamas
parade
parallel
paramedic
pardon
parent
park
partially
participate
partly
partner
party
pass
passenger
passport
password
past
patient
patiently
pattern
patterned
pause
pay
peak
pedestrian
peek
peer
pen
percentage
perhaps
periodically
permanent
permanently
persistently
pharmacy
phase
phone
phonetic
photographer
photography
phrase
pick
pickup
picnic
pill
pillow
pilot
pink
place
plain
plan
planner
plate
play
pleasant
please
pleased
pledge
police
polish
polite
politely
poorer
portion
possess
possesses
possibly
post
postpone
pour
practice
predominantly
prefer
preference
premiere
prepare
prescription
presentation
presently
press
presumably
presume
pretend
pretty
prevent
previously
price
prior
priority
probably
problem
proceed
professional
profile
program
progress
project
promise
promoted
promotion
promptly
pronounce
proof
properly
proportion
propose
protect
provide
pull
punctual
purple
purse
push
put
puzzled
qr
quality
quantity
quarter
question
quicker
quickly
quiet
quietly
rain
rainbow
raised
ran
rapidly
rarely
rarely ever
rate
rather
ratio
read
realize
rearrange
rebuild
recall
receipt
receive
recently
reception
recognize
recommend
record
recover
red
reflect
refresh
refreshed
refund
refundable
refuse
regular
regularly
relationship
relative
relax
relaxed
relaxing
reliable
reluctant
remain
remember
remind
reminisce
renew
repair
repeatedly
replace
reply
report
require
reschedule
rescue
resemble
reservation
reserve
resigned
resolve
respect
responder
responsible
rest
restore
resume
retired
retirement
retreat
return
reunion
review
revolution
rewarding
rice
ring
rinse
rise
roam
roaming
robe
roll
roommate
rougher
roundabout
roundtrip
route
routine
routinely
rude
run
rush
sad
safe
safely
safer
said
sale
salty
sat
satisfied
satisfy
satisfying
saturday
sauce
save
saw
scan
scarcely
scared
scarf
scene
schedule
scooter
scrape
screen
scrub
scruffy
season
seasonal
second
secondhand
secretary
secure
see
seemingly
seen
seldom
seldom ever
select
selfish
sell
seminar
send
september
serve
set
seven
seventeen
seventh
seventy
several
shake
shall
shallower
shampoo
share
she
sheet
shelter
shine
shocked
short
shortcut
shorter
shortly
shortterm
should
shout
show
show up
showcase
shower
shy
sick
side
sidewalk
sign
silent
silk
similar
simpler
simply
since
sincerely
sing
singer
single
sink
sister
sit
six
sixteen
sixth
sixty
size
skate
ski
skied
skill
skinny
skyward
sleep
sleepy
sleeve
slippers
slow
slower
slowly
small
smart
smell
smoke
smoother
snack
snap
sniff
snooze
snore
snow
so
so far
soak
soap
social
socialize
softer
softly
soldier
solely
solve
some
somebody
someday
someone
something
sometimes
somewhat
son
soon
sooner
sorry
sound
soup
sour
sparkle
speak
special
speculate
speech
spell
spend
spicy
spoken
spoon
sporadically
spot
spring
squint
stable
stadium
stage
stairs
stand
standard
stare
start
started
starter
starving
stay
stayed
steadily
steamed
still
stolen
stood
stop
stopping
storm
stormy
story
straight
stranded
stranger
stressed
stressful
stretch
stripe
striped
strong
strongly
struggle
stuck
student
study
style
stylish
submit
subway
succeed
suddenly
suggest
suitcase
summer
sunday
sunny
support
suppose
supposedly
surcharge
surely
surf
surgery
surprised
survive
suspect
swear
sweater
sweep
sweet
swiftly
swim
switch
switchboard
syllable
sympathize
table
take
take care
take place
taken
talent
talked
tall
tanned
tap
task
tasty
tax
taxi
tea
teacher
tedious
teenager
tell
temporarily
temporary
ten
tenth
terminal
terrible
terrified
text
thank
thanks
that afternoon
that evening
that morning
that night
the best
the day after tomorrow
the day before
the day before yesterday
the first
the funniest
the greatest
the last
the least
the month before
the most
the only
the previous
the strangest
the week before
the worst
the year before
theater
their
them
themselves
then
there
thereafter
therefore
these days
they
thicker
thing
think
thinner
third
thirsty
thirteen
thirty
thoroughly
thought
thousand
three
thrilled
throughout
thunder
thursday
ticket
tidy
tight
till
till now
timetable
tip
tired
to
toast
today
together
told
tomorrow
tonight
too
took
toothbrush
top
topping
total
totally
touch
tougher
tour
towel
town
tradition
traditional
traffic
train
transfer
transferred
transform
transformation
transit
transition
translate
translator
trapped
travel
traveled
treat
treatment
trendy
trip
triumph
trunk
trust
tuesday
tunnel
turn out
twelve
twenty
twice
two
type
typical
ugly
ultimately
umbrella
under
understand
unexpectedly
unfortunately
unless
unlikely
unlimited
unlock
unpack
until
until now
unusual
up
up to now
uptown
upward
urgent
us
use
used
username
usually
utterly
vacuum
valid
value
variation
vehicle
verify
very
video
view
village
visit
visited
visitor
vital
voicemail
volume
volunteer
vow
waist
wait
waiter
walk
walked
wallet
wander
ward
warm
warn
warranty
was
wash
washed
wasn't
watch
watched
water
way back
we
wealthier
wear
weather
website
wedding
wednesday
week
weekday
weekend
weekly
welcome
well
went
were
weren't
wet
what
whatever
whatfor
whatsoever
when
whenever
where
whereas
whereto
wherever
whether
which
white
who
whom
whose
why
whyever
wider
wife
will
willing
win
window
windy
wink
winter
wipe
wish
withdraw
within
witness
wonder
wonderful
wool
work
work out
worked
worker
workshop
worry
worse
worth
would
wrinkled
write
written
wrote
yawn
year
yearly
yellow
yes
yesterday
yesteryear
yoga
you
young
your
yourself
youth
zero
zilch
zip
zone
zoo
